# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentReloadedLatestEventArgs..::..Location Property
DocumentReloadedLatestEventArgs Class See Also
---
Full path of the central model which is to be operated.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public string Location { get; set; }
```

Visual Basic
---
```text
Public Property Location As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Location {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DocumentReloadedLatestEventArgs Class
Autodesk.Revit.DB.Events Namespace